Masmiseim36/nxpSDK/boards/frdmk66f/demo_apps/bubble_peripheral/pin_mux.c
/*
 * The Clear BSD License
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 * that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/***********************************************************************************************************************

 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file

 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.

 **********************************************************************************************************************/



/* clang-format off */

/*

 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************

!!GlobalInfo

product: Pins v4.0

processor: MK66FN2M0xxx18

package_id: MK66FN2M0VMD18

mcu_data: ksdk2_0

processor_version: 0.0.11

board: FRDM-K66F

pin_labels:

- {pin_num: B9, pin_signal: PTD9/I2C0_SDA/LPUART0_TX/FB_A17, label: 'U8[6]/U19[12]/I2C0_SDA', identifier: ACCEL_I2C_SDA;GYRO_SDA}

- {pin_num: C9, pin_signal: PTD8/LLWU_P24/I2C0_SCL/LPUART0_RX/FB_A16, label: 'U8[4]/U19[11]/I2C0_SCL', identifier: ACCEL_I2C_SCL;GYRO_SCL}

 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********

 */

/* clang-format on */



#include "fsl_common.h"

#include "fsl_port.h"

#include "fsl_gpio.h"

#include "pin_mux.h"



/* FUNCTION ************************************************************************************************************

 *

 * Function Name : BOARD_InitBootPins

 * Description   : Calls initialization functions.

 *

 * END ****************************************************************************************************************/

void BOARD_InitBootPins(void)

{

    BOARD_InitPins();

}



/* clang-format off */

/*

 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************

BOARD_InitPins:

- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}

- pin_list:

  - {pin_num: E10, peripheral: UART0, signal: RX, pin_signal: TSI0_CH9/PTB16/SPI1_SOUT/UART0_RX/FTM_CLKIN0/FB_AD17/SDRAM_D17/EWM_IN/TPM_CLKIN0}

  - {pin_num: E9, peripheral: UART0, signal: TX, pin_signal: TSI0_CH10/PTB17/SPI1_SIN/UART0_TX/FTM_CLKIN1/FB_AD16/SDRAM_D16/EWM_OUT_b/TPM_CLKIN1}

  - {pin_num: D7, peripheral: FTM3, signal: 'CH, 5', pin_signal: ADC1_SE5b/CMP0_IN3/PTC9/FTM3_CH5/I2S0_RX_BCLK/FB_AD6/SDRAM_A14/FTM2_FLT0, identifier: ''}

  - {pin_num: E1, peripheral: FTM3, signal: 'CH, 1', pin_signal: PTE6/LLWU_P16/SPI1_PCS3/UART3_CTS_b/I2S0_MCLK/FTM3_CH1/USB0_SOF_OUT, identifier: ''}

 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********

 */

/* clang-format on */



/* FUNCTION ************************************************************************************************************

 *

 * Function Name : BOARD_InitPins

 * Description   : Configures pin routing and optionally pin electrical features.

 *

 * END ****************************************************************************************************************/

void BOARD_InitPins(void)

{

    /* Port B Clock Gate Control: Clock enabled */

    CLOCK_EnableClock(kCLOCK_PortB);

    /* Port C Clock Gate Control: Clock enabled */

    CLOCK_EnableClock(kCLOCK_PortC);

    /* Port E Clock Gate Control: Clock enabled */

    CLOCK_EnableClock(kCLOCK_PortE);



    /* PORTB16 (pin E10) is configured as UART0_RX */

    PORT_SetPinMux(BOARD_DEBUG_UART_RX_PORT, BOARD_DEBUG_UART_RX_PIN, kPORT_MuxAlt3);



    /* PORTB17 (pin E9) is configured as UART0_TX */

    PORT_SetPinMux(BOARD_DEBUG_UART_TX_PORT, BOARD_DEBUG_UART_TX_PIN, kPORT_MuxAlt3);



    /* PORTC9 (pin D7) is configured as FTM3_CH5 */

    PORT_SetPinMux(PORTC, 9U, kPORT_MuxAlt3);



    /* PORTE6 (pin E1) is configured as FTM3_CH1 */

    PORT_SetPinMux(PORTE, 6U, kPORT_MuxAlt6);



    SIM->SOPT5 = ((SIM->SOPT5 &

                   /* Mask bits to zero which are setting */

                   (~(SIM_SOPT5_UART0TXSRC_MASK)))



                  /* UART 0 transmit data source select: UART0_TX pin. */

                  | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX));

}



/* clang-format off */

/*

 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************

BOARD_I2C_ConfigurePins:

- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}

- pin_list:

  - {pin_num: C9, peripheral: I2C0, signal: SCL, pin_signal: PTD8/LLWU_P24/I2C0_SCL/LPUART0_RX/FB_A16, slew_rate: fast, open_drain: enable, pull_select: up, pull_enable: enable,

    digital_filter: disable}

  - {pin_num: B9, peripheral: I2C0, signal: SDA, pin_signal: PTD9/I2C0_SDA/LPUART0_TX/FB_A17, slew_rate: fast, open_drain: enable, pull_select: up, pull_enable: enable,

    digital_filter: disable}

 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********

 */

/* clang-format on */



/* FUNCTION ************************************************************************************************************

 *

 * Function Name : BOARD_I2C_ConfigurePins

 * Description   : Configures pin routing and optionally pin electrical features.

 *

 * END ****************************************************************************************************************/

void BOARD_I2C_ConfigurePins(void)

{

    /* Port D Clock Gate Control: Clock enabled */

    CLOCK_EnableClock(kCLOCK_PortD);

    /* Configure digital filter */

    PORT_EnablePinsDigitalFilter(

        /* Digital filter is configured on port D */

        PORTD,

        /* Digital filter is configured for PORTD0 */

          PORT_DFER_DFE_8_MASK

            /* Digital filter is configured for PORTD1 */

            | PORT_DFER_DFE_9_MASK,

        /* Disable digital filter */

        false);



    const port_pin_config_t portd8_pinC9_config = {/* Internal pull-up resistor is enabled */

                                                   kPORT_PullUp,

                                                   /* Fast slew rate is configured */

                                                   kPORT_FastSlewRate,

                                                   /* Passive filter is disabled */

                                                   kPORT_PassiveFilterDisable,

                                                   /* Open drain is enabled */

                                                   kPORT_OpenDrainEnable,

                                                   /* Low drive strength is configured */

                                                   kPORT_LowDriveStrength,

                                                   /* Pin is configured as I2C0_SCL */

                                                   kPORT_MuxAlt2,

                                                   /* Pin Control Register fields [15:0] are not locked */

                                                   kPORT_UnlockRegister};

    /* PORTD8 (pin C9) is configured as I2C0_SCL */

    PORT_SetPinConfig(PORTD, 8U, &portd8_pinC9_config);



    const port_pin_config_t portd9_pinB9_config = {/* Internal pull-up resistor is enabled */

                                                   kPORT_PullUp,

                                                   /* Fast slew rate is configured */

                                                   kPORT_FastSlewRate,

                                                   /* Passive filter is disabled */

                                                   kPORT_PassiveFilterDisable,

                                                   /* Open drain is enabled */

                                                   kPORT_OpenDrainEnable,

                                                   /* Low drive strength is configured */

                                                   kPORT_LowDriveStrength,

                                                   /* Pin is configured as I2C0_SDA */

                                                   kPORT_MuxAlt2,

                                                   /* Pin Control Register fields [15:0] are not locked */

                                                   kPORT_UnlockRegister};

    /* PORTD9 (pin B9) is configured as I2C0_SDA */

    PORT_SetPinConfig(PORTD, 9U, &portd9_pinB9_config);

}



/* clang-format off */

/*

 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************

BOARD_Init_I2C_GPIO_pins:

- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}

- pin_list:

  - {pin_num: C9, peripheral: GPIOD, signal: 'GPIO, 8', pin_signal: PTD8/LLWU_P24/I2C0_SCL/LPUART0_RX/FB_A16, identifier: ACCEL_I2C_SCL, direction: OUTPUT, gpio_init_state: 'true'}

  - {pin_num: B9, peripheral: GPIOD, signal: 'GPIO, 9', pin_signal: PTD9/I2C0_SDA/LPUART0_TX/FB_A17, identifier: ACCEL_I2C_SDA, direction: OUTPUT, gpio_init_state: 'true'}

 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********

 */

/* clang-format on */



/* FUNCTION ************************************************************************************************************

 *

 * Function Name : BOARD_Init_I2C_GPIO_pins

 * Description   : Configures pin routing and optionally pin electrical features.

 *

 * END ****************************************************************************************************************/

void BOARD_Init_I2C_GPIO_pins(void)

{

    /* Port D Clock Gate Control: Clock enabled */

    CLOCK_EnableClock(kCLOCK_PortD);



    gpio_pin_config_t ACCEL_I2C_SCL_config = {

        .pinDirection = kGPIO_DigitalOutput,

        .outputLogic = 1U

    };

    /* Initialize GPIO functionality on pin PTD8 (pin C9)  */

    GPIO_PinInit(BOARD_ACCEL_I2C_SCL_GPIO, BOARD_ACCEL_I2C_SCL_PIN, &ACCEL_I2C_SCL_config);



    gpio_pin_config_t ACCEL_I2C_SDA_config = {

        .pinDirection = kGPIO_DigitalOutput,

        .outputLogic = 1U

    };

    /* Initialize GPIO functionality on pin PTD9 (pin B9)  */

    GPIO_PinInit(BOARD_ACCEL_I2C_SDA_GPIO, BOARD_ACCEL_I2C_SDA_PIN, &ACCEL_I2C_SDA_config);



    /* PORTD8 (pin C9) is configured as PTD8 */

    PORT_SetPinMux(BOARD_ACCEL_I2C_SCL_PORT, BOARD_ACCEL_I2C_SCL_PIN, kPORT_MuxAsGpio);



    /* PORTD9 (pin B9) is configured as PTD9 */

    PORT_SetPinMux(BOARD_ACCEL_I2C_SDA_PORT, BOARD_ACCEL_I2C_SDA_PIN, kPORT_MuxAsGpio);

}

/***********************************************************************************************************************

 * EOF

 **********************************************************************************************************************/

